---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyle.IsFontBold
source: html/f38e5f7d-3e31-874e-6842-01ae2a52d8f0.htm
---
# Autodesk.Revit.DB.TableCellStyle.IsFontBold Property

Gets or sets whether the text font is set to bold of this cell.

## Syntax (C#)
```csharp
public bool IsFontBold { get; set; }
```